Revit 2024 API
FamilyStructuralMaterialTypeFilter Members
The FamilyStructuralMaterialTypeFilter type exposes the following members.
Constructors
Name | Description
FamilyStructuralMaterialTypeFilter(StructuralMaterialType)
 Constructs a new instance of a filter to match families that have the given structural material type.
FamilyStructuralMaterialTypeFilter(StructuralMaterialType, Boolean)
 Constructs a new instance of a filter to match families by structural material type, with the option to match all families which are not of the given structural material type.
Methods
Name | Description
Dispose |  (Inherited from ElementFilter.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PassesFilter(Element)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
 (Inherited from ElementFilter.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ElementFilter.)
StructuralMaterialType
 The family structural material type.
See Also
FamilyStructuralMaterialTypeFilter Class
Autodesk.Revit.DB.Structure Namespace